Repository: andreaskastl/openweatherapi
Catalog: Resources/Private/Language/*.locallang.xlf
Languages: de

# extension.name
source: Weather Forecast
de: Wettervorhersage

# extension.description
source: Displays weather forecast for a selected location based on wetter.com openweather API.
de: Anzeige der Wettervorhersage für einen ausgewählten Ort basierend auf der wetter.com openweather API.

# flexform.settings.title
source: Properties (based on wetter.com subscription)
de: Einstellungen (basierend auf der Registrierung bei wetter.com)

# flexform.settings.projectName
source: Project Name (required)
de: Projektname (erforderlich)

# flexform.settings.apiKey
source: API Key (required)
de: API Key (erforderlich)

# flexform.settings.cityCode
source: City Code (required)
de: City Code (erforderlich)

# error.xmlNotFetched
source: Weather forecast is currently not available (data retrieval error).
de: Die Wettervorhersage steht derzeit nicht zur Verfügung (Datenfehler).

# error.xmlDataMissing
source: Weather forecast is currently not available (API error). Please check your plugin configuration.
de: Die Wettervorhersage steht derzeit nicht zur Verfügung (API Fehler). Bitte prüfen Sie die Plugin-Konfiguration.

# error.url
source: Weather forecast is currently not available (connection error). Please check your plugin configuration.
de: Die Wettervorhersage steht derzeit nicht zur Verfügung (Verbindungsfehler). Bitte prüfen Sie die Plugin-Konfiguration.

# error.templateNotFound
source: Custom HTML template not found or plugin's static TypoScript not included in site config.
de: Das benutzerdefinierte HTML-Template wurde nicht gefunden oder das statische TypoScript wurde der Konfiguration nicht zugeordnet.

# label.interval
source: to
de: bis

# label.winddirection
source: from
de: aus

# label.precipitation
source: Precipitation
de: Niederschlag
